Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: You don't need to use `@Blocking` as the signature is synchronous. No more wall of text!
ja_jp: シグネチャが同期であるため、 `@Blocking` を使用する必要はありません。もう壁のようなテキストは必要ありません。

source: You don't need to worry about setting it up most of the time as extensions needing it will simply add it as a dependency. Hibernate ORM for example will include the transaction manager and set it up properly.
ja_jp: これを必要とするエクステンションは単に依存関係として追加するだけなので、ほとんどの場合、設定について心配する必要はありません。例えばHibernate ORMはトランザクションマネージャーを含んでおり、適切に設定してくれます。

source: You don’t need to set the Pulsar topic, nor the consumer name. By default, the connector uses the channel name (`prices`). You can configure the `topic` and `consumerName` attributes to override them.
ja_jp: Pulsar トピックやコンシューマー名を設定する必要はありません。 デフォルトでは、コネクターはチャネル名 (`prices`) を使用します。 トピックとコンシューマー名は、 `topic` 属性と `consumerName` 属性を設定してオーバーライドすることができます。

source: You don’t need to set the Pulsar topic, nor the producer name. By default, the connector uses the channel name (`prices`). You can configure the `topic` and `producerName` attributes to override them.
ja_jp: Pulsar トピックやプロデューサー名を設定する必要はありません。 デフォルトでは、コネクターはチャネル名 (`prices`) を使用します。 トピックとコンシューマー名は、 `topic` 属性と `producerName` 属性を設定してオーバーライドすることができます。

source: You get messages containing the MDC data:
ja_jp: MDCのデータを含むメッセージが得られます:

source: You have Apache Maven {maven-version} installed.
ja_jp: Apache Maven {maven-version}がインストールされていること

source: You have OpenJDK {jdk-version-all} installed.
ja_jp: OpenJDK {jdk-version-all} がインストールされていること

source: You have OpenJDK {jdk-version-other} or later installed.
ja_jp: OpenJDK {jdk-version-other} 以降がインストールされていること

source: You have a Hibernate ORM-based application? You want to provide a full-featured full-text search to your users? You're at the right place.
ja_jp: Hibernate ORMベースのアプリケーションを持ってますか？フル機能の全文検索をユーザーに提供したいですか？あなたは正しいドキュメントを読んでいます。

source: You have a Quarkus Maven project that includes the `quarkus-openshift` extension.
ja_jp: Quarkus Maven プロジェクトに `quarkus-openshift` エクステンションが含まれていること。

source: You have a Quarkus Maven project.
ja_jp: Quarkus Mavenプロジェクトがあること

source: You have a Quarkus application built with Java {jdk-ver-other}.
ja_jp: Java {jdk-ver-other} で構築されたQuarkusアプリケーションがあること

source: You have a Quarkus application built with Java {jdk-version-all}.
ja_jp: Java {jdk-version-all} で構築された Quarkus アプリケーションがあります。

source: You have a Quarkus application? You want to provide a full-featured full-text search to your users? You're at the right place.
ja_jp: Quarkus アプリケーションをお持ちですか? フル機能のフルテキスト検索をユーザーに提供したいとお考えですか? このガイドでは、最適な方法を提供しています。

source: You have a Quarkus project that includes the `quarkus-openshift` extension.
ja_jp: Quarkusプロジェクトには、 `quarkus-openshift` エクステンション含まれていること

source: You have a dedicated frontend team familiar with tools such as NPM, Yarn and other for building Single Page Apps.
ja_jp: Single Page App を構築するための NPM、Yarn などのツールに精通した専任のフロントエンドチームがある。

source: You have access to a {openshift} cluster and the latest compatible version of the `oc` CLI tool installed.
ja_jp: {openshift} クラスタにアクセスでき、 `oc` CLIツールの最新互換バージョンがインストールされていること

source: You have access to an {openshift} cluster and the latest compatible version of the `oc` CLI tool installed.
ja_jp: {openshift} クラスタにアクセスでき、 `oc` CLIツールの最新互換バージョンがインストールされていること

source: You have access to an {openshift} cluster and the latest compatible version of the `oc` tool installed.
ja_jp: {openshift} クラスタにアクセスでき、 `oc` ツールの最新の互換バージョンがインストールされています。

source: You have already used OIDC DevUI SPA to login to Auth0 and test the Quarkus endpoint with the access token, updating the endpoint code along the way.
ja_jp: すでに OIDC DevUI SPA を使用して Auth0 にログインし、アクセストークンを使用して Quarkus エンドポイントをテストし、その過程でエンドポイントコードを更新しています。

source: You have an editor or IDE that provides syntax highlighting and previews for AsciiDoc, either natively or with a plugin.
ja_jp: AsciiDoc の構文の強調表示とプレビューを提供するエディターまたは IDE がある。(ネイティブまたはプラグイン)

source: You have an existing frontend configured with a npm-compatible build tool, Quinoa is the most direct option.
ja_jp: npm 互換のビルドツールで設定された既存のフロントエンドがある。Quinoa が最も直接的なオプションです。

source: You have created a project that uses the Micrometer and Prometheus Meter Registry extensions to collect metrics. You've observed some of the metrics that Quarkus captures automatically, and have added a `Counter` and `Timer` that are unique to the application. You've also added dimensional labels to metrics, and have observed how those labels shape the data emitted by the prometheus endpoint.
ja_jp: これで Micrometer および Prometheus Meter Registry エクステンションを使用してメトリクスを収集するプロジェクトの作成が完了しました。Quarkus が自動的にキャプチャするいくつかのメトリクスを確認し、アプリケーションに固有の `Counter` と `Timer` を追加しました。さらに、メトリクスにディメンションラベルを追加し、それらのラベルが prometheus エンドポイントによって出力されるデータをどのように形成するかを観測しました。

source: You have developed and tested the Quarkus endpoint secured with Auth0 in the development mode. The next step is to run your application in the production mode. Choose between JVM and native modes.
ja_jp: Auth0 で保護された Quarkus エンドポイントを開発モードで開発およびテストしました。 次のステップでは、アプリケーションを本番モードで実行します。 JVM モードとネイティブモードを選択します。

source: You have found nowhere.<br/>The pathway to normal space<br/>is found in the nav.
ja_jp: どこでもないスペースを見つけました。<br/> 通常のスペースへのパスは、<br/> ナビゲーションメニューに存在します。

source: You have installed at least one extension that provides an `IdentityProvider` based on username and password, such as xref:security-jdbc.adoc[Elytron JDBC].
ja_jp: ユーザ名とパスワードに基づいた `IdentityProvider` を提供するエクステンションが1つ以上インストールされています。例えば、xref:security-jdbc.adoc [Elytron JDBC] などです。

source: You have installed at least one extension that provides an `IdentityProvider` based on username and password. For example:
ja_jp: ユーザー名とパスワードに基づいて `IdentityProvider` を提供するエクステンションを少なくとも 1 つインストールしている。 たとえば:

source: You have learned how to set up and use the OIDC authorization code flow mechanism to protect and test application HTTP endpoints. After you have completed this tutorial, explore xref:security-oidc-bearer-token-authentication.adoc[OIDC Bearer token authentication] and xref:security-authentication-mechanisms.adoc[other authentication mechanisms].
ja_jp: アプリケーションの HTTP エンドポイントを保護し、テストするために、OIDC 認可コードフローメカニズムを設定し、使用する方法を学びました。 このチュートリアルを終えたら、 xref:security-oidc-bearer-token-authentication.adoc[OIDC ベアラー認証] や xref:security-authentication-mechanisms.adoc[その他の認証メカニズム] を調べてみてください。

source: You have not provided any JWT in our request, so you would not expect the endpoint to see any security state, and the response is consistent with that:
ja_jp: リクエストで JWT が提供されていないため、エンドポイントでセキュリティー状態が確認されることはなく、応答もそれと一致しています。

source: You have noticed how much more compact and readable the code is compared to using the MongoDB API? Does this look interesting? Read on!
ja_jp: MongoDBのAPIを使った場合と比べて、コードがどれだけコンパクトで読みやすくなったかお気づきでしょうか？これは面白いと思いませんか？読んでみてください。

source: You have noticed how much more compact and readable the code is? Does this look interesting? Read on!
ja_jp: コードがどれだけコンパクトで読みやすくなっているかお気づきですか?面白いと思いませんか?読んでみてください。

source: You have reviewed the following Quarkus contributor resources:
ja_jp: 以下の Quarkus コントリビューターリソースを確認した。

source: You have set the `JAVA_HOME` environment variable to the location of the Java SDK.
ja_jp: 環境変数 `JAVA_HOME` をJava SDKの場所に設定していること

source: You have successfully learned how to create and test a secure Quarkus application. This was achieved by integrating the built-in xref:security-basic-authentication.adoc[Basic authentication] in Quarkus with the Jakarta Persistence identity provider.
ja_jp: 安全な Quarkus アプリケーションを作成し、テストする方法を学習しました。 これは、Quarkus に組み込まれている xref:security-basic-authentication.adoc[Basic 認証] を Jakarta Persistence アイデンティティープロバイダーと統合することによって実現されました。

source: You have tested that `FrontendResource` can propagate the access tokens from the OpenID Connect Dev UI.
ja_jp: これで、 `FrontendResource` が OpenID Connect Dev UI からアクセストークンを伝播できることをテストできました。

source: You have the https://docs.asciidoctor.org/asciidoc/latest/syntax-quick-reference/[AsciiDoc syntax reference] nearby.
ja_jp: https://docs.asciidoctor.org/asciidoc/latest/syntax-quick-reference/[AsciiDoc 構文リファレンス] がある。

source: You have the option to configure two properties for data expiration: *lifespan* and *max-idle*.
ja_jp: データの有効期限については、*lifespan* と *max-idle* の 2 つのプロパティーを設定するオプションがあります。

source: You have to add a file named `dev-templates/embedded.html` in your xref:building-my-first-extension.adoc#description-of-a-quarkus-extension[`deployment`] extension module's resources:
ja_jp: link:building-my-first-extension.html#description-of-a-quarkus-extension[`deployment`]エクステンションモジュールのリソースに `dev-templates/embedded.html` というファイルを追加する必要があります。

source: You have to think that the bundled output is essentially the same with both solutions. Also, switching from one to the other is not a big deal, the choice is about the developer experience and finding the best fit for your team.
ja_jp: バンドルされた出力は、どちらのソリューションでも本質的には同じであると考えなければなりません。また、どちらか一方から他方に切り替えることは重大ではないため、開発者のエクスペリエンスとチームに最適なものを見つけることが重要です。

source: You have to use `org.acme` as the package name in your extension codestart sources. In the generated project, the user specified package (or Group) will be used (and automatically replace `org.acme`).
ja_jp: エクステンションの Codestart のソースでは、パッケージ名として `org.acme` を使用する必要があります。生成されたプロジェクトでは、ユーザーが指定したパッケージが使用されます (そして、 `org.acme` を自動的に置き換えます)。

source: You have to use `org.acme` as the package name in your extension codestart sources. In the generated project, the user specified package will be used (and auto-replace `org.acme`).
ja_jp: エクステンションの codestart のソースでは、パッケージ名として `org.acme` を使用する必要があります。生成されたプロジェクトでは、ユーザーが指定したパッケージが使用されます (そして、 `org.acme` を自動的に置き換えます)。

source: You inject the channel representing the Kafka topic in your HTTP endpoint
ja_jp: Kafka トピックを表すチャネルを HTTP エンドポイントに注入します

source: You just need to add the `openapi` extension to your Quarkus application:
ja_jp: Quarkusアプリケーションに `openapi` のエクステンションを追加するだけです。

source: You just need to configure how you want to locate and select your services. The rest will be handled by the clients directly.
ja_jp: あなたは、サービスをどのように探索し、選択したいかを設定するだけです。あとはクライアントが直接対応してくれます。

source: You just need to run both applications using:
ja_jp: 以下を使用して両方のアプリケーションを実行する必要があります。

source: You just need to run both applications. In one terminal, run:
ja_jp: 両方のアプリケーションを実行する必要があります。1 つの端末で、次を実行します。

source: You likely need to configure your OpenID Connect provider to support redirecting back to the `Dev Console`. You add `http://localhost:8080/q/dev-ui/io.quarkus.quarkus-oidc/<providerName>-provider` as one of the supported redirect and logout URLs, where `<providerName>` must be replaced by the name of the provider shown in the Dev UI, for example, `auth0`.
ja_jp: 多くの場合、 `Dev Console` へのリダイレクトをサポートするように OpenID Connect プロバイダーを設定する必要があります。 `http://localhost:8080/q/dev-ui/io.quarkus.quarkus-oidc/<providerName>-provider` を、サポートされているリダイレクトおよびログアウト URL の 1 つとして追加します。 `<providerName> ` は、Dev UI に表示されるプロバイダーの名前 (例: `auth0`) に置き換える必要があります。

source: You likely need to configure your OpenID Connect provider to support redirecting back to the `Dev Console`. You add `http://localhost:8080/q/dev-ui/quarkus-oidc/<providerName>-provider` as one of the supported redirect and logout URLs, where `<providerName>` must be replaced by the name of the provider shown in the Dev UI, for example, `auth0`.
ja_jp: OpenID Connect プロバイダーを、`Dev Console` へのリダイレクトをサポートするように設定する必要があるでしょう。`http://localhost:8080/q/dev-ui/quarkus-oidc/<providerName>-provider` をサポートされているリダイレクトおよびログアウト URL の 1 つとして追加します。ここで、`<providerName>` は Dev UI に表示されるプロバイダー名 (例: `auth0`) に置き換える必要があります。

source: You love package.json and configurations tweaking
ja_jp: package.json と設定の調整を好む。

source: You may add a `README.md` or `README.tpl.qute.md` in the `base` directory, it will be appended to the others. So just add the info relative to your extension codestart.
ja_jp: `base` ディレクトリに `README.md` や `README.tpl.qute.md` を追加することが出来ます。他のものに追加されます。つまり、エクステンション codestart に関連する情報を追加するだけです。

source: You may add some other resources (in the `./base` directory if they are not language-specific).
ja_jp: 他のリソースを追加することもできます (言語固有でない場合は、 `./base` ディレクトリーに)。

source: You may also need to set `quarkus.oidc.authentication.cookie-path` to a path value common to all of the application resources which is `/` in this example. See <<oidc-cookies, Dealing with Cookies>> for more information.
ja_jp: また、 `quarkus.oidc.authentication.cookie-path` をすべてのアプリケーション・リソースに共通のパス値に設定する必要があるかもしれません。この例では、 `/` です。 詳しくは xref:oidc-cookies[クッキーの扱い] を参照してください。

source: You may also need to set `quarkus.oidc.authentication.cookie-path` to a path value common to all the application resources which is `/` in this example. For more information, see the xref:oidc-cookies[Cookies] section.
ja_jp: また、 `quarkus.oidc.authentication.cookie-path` に、すべてのアプリケーションリソースに共通するパス値（この例では `/` ）を設定する必要がある場合があります。詳しくは、 xref:oidc-cookies[Cookie] の項を参照してください。

source: You may also need to set `quarkus.oidc.authentication.cookie-path` to a path value common to all the application resources which is `/` in this example. See <<oidc-cookies, Dealing with Cookies>> for more information.
ja_jp: また、 `quarkus.oidc.authentication.cookie-path` に、すべてのアプリケーションリソースに共通するパス値 (この例では `/` ) を設定する必要がある場合もあります。詳しくは、 <<oidc-cookies, クッキーの取り扱い>> を参照してください。

source: You may also observe that Vert.x OIDC uses a session cookie to track the authorization code flow progress as well as the authenticated user's session.
ja_jp: また、Vert.x OIDC が認可コードフローの進行状況と認証済みユーザーのセッションを追跡するためにセッションクッキーを使用していることも観察できるでしょう。

source: You may also want to add one or more scopes in addition to the scopes requested by default. For example, if you would like to use an access token issued by `Google` to access `Google Calendar` service, you can do it like this:
ja_jp: デフォルトで要求されるスコープに加えて、1 つ以上のスコープを追加することもできます。たとえば、 `Google` が発行したアクセストークンを使用して `Google Calendar` サービスにアクセスする場合は、次のようにします。

source: You may also want to have a look at https://quarkus.io/guides/security-authorize-web-endpoints-reference[how to apply authorization rules to the HTTP request paths], without having to use annotations.
ja_jp: また、アノテーションを使用せずに、 https://quarkus.io/guides/security-authorize-web-endpoints-reference[HTTP リクエストパスに認可ルールを適用する方法] も確認しておくとよいでしょう。

source: You may annotate your endpoint class with the link:{jaxrsapi}/jakarta/ws/rs/Produces.html[`@Produces`] or link:{jaxrsapi}/jakarta/ws/rs/Consumes.html[`@Consumes`] annotations, which allow you to specify one or more media types that your endpoint may accept as HTTP request body or produce as HTTP response body. Those class annotations apply to each method.
ja_jp: エンドポイントクラスに、link:{jaxrsapi}/jakarta/ws/rs/Produces.html[`@Produces`] または link:{jaxrsapi}/jakarta/ws/rs/Consumes.html[`@Consumes`] アノテーションとして追加できます。 これにより、エンドポイントが HTTP リクエストボディーとして使用できる 1 つ以上のメディアタイプを指定するか、 https レスポンスボディーとして生成できます。これらのクラスアノテーションは、各メソッドに適用されます。

source: You may annotate your endpoint class with the link:{jaxrsapi}/javax/ws/rs/Produces.html[`@Produces`] or link:{jaxrsapi}/javax/ws/rs/Consumes.html[`@Consumes`] annotations, which allow you to specify one or more media types that your endpoint may accept as HTTP request body or produce as HTTP response body. Those class annotations apply to each method.
ja_jp: link:{jaxrsapi}/javax/ws/rs/Produces.html[`@Produces`] または link:{jaxrsapi}/javax/ws/rs/Consumes.html[`@Consumes`] アノテーションで、エンドポイントクラスをアノテーションできます。この場合、エンドポイントが HTTP リクエストボディとして受け入れ、HTTP レスポンスボディとして生成できるメディアタイプを一つまたは複数指定することが可能です。これらのクラスアノテーションは、各メソッドに適用されます。

source: You may be used to seeing your Quarkus application packaged in a `target/quarkus-app/` directory, but that wasn't always the case. In the early days of Quarkus, we built a traditional runner JAR in `target/`, with dependencies placed in a `lib/` directory, much like most other Java frameworks.
ja_jp: お使いの Quarkus アプリケーションが `target/quarkus-app/` ディレクトリーにパッケージされているのをご覧になっているかもしれませんが、常にそうだったわけではありません。Quarkus の初期の頃は、他のほとんどの Java フレームワークと同様に、依存関係を `lib/` ディレクトリーに配置して、`target/` に従来のランナー JAR をビルドしていました。

source: You may call it without any parameter to use the interactive mode: `mvn io.quarkus.platform:quarkus-maven-plugin:{quarkus-version}:create-extension -N`
ja_jp: パラメータを指定せずに呼び出し、インタラクティブモードを使用することもできます。 `mvn io.quarkus.platform:quarkus-maven-plugin:{quarkus-version}:create-extension -N`

source: You may call it without any parameter to use the interactive mode: `mvn {quarkus-platform-groupid}:quarkus-maven-plugin:{quarkus-version}:create-extension -N`
ja_jp: パラメーターなしで呼び出し、インタラクティブ・モードを使用することも出来ます: `mvn {quarkus-platform-groupid}:quarkus-maven-plugin:{quarkus-version}:create-extension -N`

source: You may declare an observer method that has a return type of `CompletionStage<>` or `Uni<>`, but neither the return type nor the actual return value affect the result of `Event.fireAsync()`. Further, if the observer declares a return type of `Uni<>`, the returned `Uni` will not be subscribed to, so it is quite possible that part of the observer logic will not even execute.
ja_jp: 戻り値の型が `CompletionStage<>` または `Uni<>` であるオブザーバーメソッドを宣言できますが、戻り値の型も実際の戻り値も `Event.fireAsync()` の結果には影響しません。 さらに、オブザーバーが戻り値の型として `Uni<>` を宣言した場合、返された `Uni` はサブスクライブされないため、オブザーバーロジックの一部が実行されない可能性も十分にあります。

source: You may declare an observer method that has a return type of `CompletionStage<>` or `Uni<>`, but neither the return type nor the actual return value affects the result of `Event.fireAsync()`. Further, if the observer declares a return type of `Uni<>`, the returned `Uni` will not be subscribed to, so it is quite possible that part of the observer logic will not even execute.
ja_jp: 戻り値の型が `CompletionStage<>` または `Uni<>` であるオブザーバーメソッドを宣言できますが、戻り値の型も実際の戻り値も `Event.fireAsync()` の結果には影響しません。さらに、オブザーバーが戻り値の型として `Uni<>` を宣言した場合、返された `Uni` はサブスクライブされないため、オブザーバーロジックの一部が実行されない可能性も十分にあります。

source: You may delete the directory `quarkus-app/lib/deployment` to save some space in your ZIP distribution or Docker image (remember to use a multistage Docker build to avoid unnecessary layers). After deleting the `deployment` directory, it is obviously not possible anymore to re-augment the application.
ja_jp: ZIP配布やDockerイメージのスペースを節約するために、 `quarkus-app/lib/deployment` ディレクトリを削除しても構いません（不要なレイヤーを避けるために、多段階のDockerビルドを使用することを忘れないでください）。 `deployment` ディレクトリを削除すると、当然ながらアプリケーションの再オーグメンテーションはできなくなります。

source: You may end up with multiple routes matching a given path. In the following example, both route matches `/accounts/me`:
ja_jp: 特定のパスに複数のルートが一致する場合があります。次の例では、両方のルートが `/accounts/me` に一致しています。

source: You may go to https://graphql.org/swapi-graphql[the webpage] to execute this query manually.
ja_jp: このクエリを手動で実行するには、 link:https://graphql.org/swapi-graphql[Webページ]にアクセスしてください。

source: You may have dependencies that contain `\*.proto` files you want to compile to Java sources. This section explains how to configure code generation to include these `\*.proto` files during code generation.
ja_jp: Java ソースにコンパイルする `\*.proto` ファイルを含む依存関係がある可能性があります。 このセクションでは、コード生成中にこれらの `\*.proto` ファイルを含めるようにコード生成を設定する方法について説明します。

source: You may need to configure the `link-name` attribute, if the queue name is not the channel name:
ja_jp: キュー名がチャネル名でない場合は、 `link-name` 属性を設定する必要がある場合があります。

source: You may need to configure the connection to your Kubernetes cluster. By default, it automatically uses the active _context_ used by `kubectl`.
ja_jp: Kubernetes クラスターへの接続の設定が必要な場合があります。デフォルトでは、`kubectl` が使用するアクティブな _context_ が自動的に使用されます。

source: You may need to inject `@RequestScoped` beans during authentication and authorization. A good example of this is accessing a database during a `SecurityIdentity` augmentation, which is described in the xref:security-customization.adoc#security-identity-customization[Security Identity Customization] section of the "Security Tips and Tricks" guide. If authentication or authorization fails with the `jakarta.enterprise.context.ContextNotActiveException`, disabling proactive authentication is most often the best solution. Users can also activate xref:cdi-reference.adoc#request-context-lifecycle[CDI request context], for example, by using the `@ActivateRequestContext` annotation. However, some CDI beans may not be ready for use.
ja_jp: 認証および認可の際に、`@RequestScoped` の Bean をインジェクトする必要がある場合があります。 適切な例として、`SecurityIdentity` の拡張時にデータベースへアクセスするケースが挙げられます。これについては、"Security Tips and Tricks" ガイドの xref:security-customization.adoc#security-identity-customization[セキュリティーアイデンティティーカスタマイズ] セクションで説明されています。 認証や認可の際に `jakarta.enterprise.context.ContextNotActiveException` が発生する場合、プロアクティブ認証を無効化する のが最も適切な解決策となることが多いです。 また、ユーザーは xref:cdi-reference.adoc#request-context-lifecycle[CDI リクエストコンテキスト] を有効化することもできます。たとえば、`@ActivateRequestContext` アノテーションを使用して有効にできます。ただし、一部の CDI Bean は利用可能な状態になっていない可能性がある点に注意してください。

source: You may need to read a specific file only present in production, or retrieve configuration data from a proprietary configuration server.
ja_jp: 本番環境にしか存在しない特定のファイルを読み込んだり、独自の設定サーバーから設定データを取得したりする必要がある場合があります。

source: You may need to register a redirect URI for the authorization code flow initiated by Dev UI for Keycloak to work because Keycloak may enforce that the authenticated users are redirected only to the configured redirect URI. It is recommended to do in production to avoid the users being redirected to the wrong endpoints which might happen if the correct `redirect_uri` parameter in the authentication request URI has been manipulated.
ja_jp: Keycloak は、認証されたユーザーが設定されたリダイレクト URI にのみリダイレクトされるように強制する場合があるため、Keycloak が機能するためには Dev UI によって開始される認可コードフローのリダイレクト URI を登録する必要がある場合があります。認証要求内の正しい `redirect_uri` パラメーターが操作されると、ユーザーが間違ったエンドポイントにリダイレクトされる可能性があるため、本番環境ではこれを行うことを推奨します。

source: You may need to request that a specific set of scopes is associated with an issued access token. Use a dedicated `quarkus.oidc-client.scopes` list property, for example: `quarkus.oidc-client.scopes=email,phone`
ja_jp: スコープの特定のセットが発行されたアクセストークンに関連付けられるように要求する必要がある場合があります。専用の `quarkus.oidc-client.scopes` リストプロパティーを使用してください (例: `quarkus.oidc-client.scopes=email,phone`)。

source: You may need to revoke access tokens, for example, in case of the local logout. See the xref:security-oidc-code-flow-authentication#oidc-token-revocation[Token revocation] section for more information.
ja_jp: たとえばローカルログアウトの場合などに、アクセストークンを失効させる必要があるかもしれません。詳細は xref:security-oidc-code-flow-authentication#oidc-token-revocation[トークンの失効] セクションを参照してください。

source: You may not specify any parameter to use the interactive mode: `mvn io.quarkus.platform:quarkus-maven-plugin:{quarkus-version}:create-extension -N`
ja_jp: インタラクティブモードを使用するために、パラメーターを指定することはできません。 `mvn io.quarkus.platform:quarkus-maven-plugin:{quarkus-version}:create-extension -N` です。

source: You may not specify any parameter to use the interactive mode: `mvn {quarkus-platform-groupid}:quarkus-maven-plugin:{quarkus-version}:create-extension -N`
ja_jp: インタラクティブモードを使用するために、パラメーターを指定することはできません: `mvn {quarkus-platform-groupid}:quarkus-maven-plugin:{quarkus-version}:create-extension -N`

source: You may override the default value of the `myapp.schema.create` property in the `application.properties` file.
ja_jp: `application.properties` ファイルの `myapp.schema.create` プロパティーのデフォルト値を上書きできます。

source: You may say... “well, let's do blocking by default.” It's not that simple. It's as dangerous to call reactive APIs expected to be called on an I/O thread on a worker thread than calling blocking APIs on the I/O thread.
ja_jp: "じゃあ、デフォルトでブロッキングをしよう" と言われるかもしれませんが、そんな単純な話ではありません。I/Oスレッドで呼び出されることが期待されるリアクティブAPIをワーカースレッドで呼び出すことは、I/OスレッドでブロッキングAPIを呼び出すことと同じくらい危険です。
